In [ ]:
import sqlite3

## Insurance Database

In [ ]:
db1 = sqlite3.connect("INSURANCE.db")
db1 = db1.cursor()

In [ ]:
db1.execute("create table person(driver_id varchar(20) primary key, name varchar(20), address varchar(20))")
db1.execute("create table car(reg_num varchar(20) primary key, model varchar(20), year int)")
db1.execute("create table accident(report_num int primary key, accident_date date, location varchar(20))")
db1.execute("create table owns(driver_id varchar(20) primary key, reg_num varchar(20), foreign key(driver_id) references person(driver_id),foreign key(reg_num) references car(reg_num))")
db1.execute("create table participated(driver_id varchar(20) primary key,reg_num varchar(20), report_num int, damage_amount int,foreign key(driver_id) references person(driver_id),foreign key(reg_num) references car(reg_num),foreign key(report_num) references accident(report_num))")

In [ ]:
person_data = [
    ('A01','Richard','Srinivas Nagar'),
('A02','Pradeep','Rajaji Nagar'),
('A03','Smith','Ashok Nagar'),
('A04','Venu','NR Colony'),
('A05','John','Hanumanth Nagar')
]

db1.executemany("INSERT INTO person VALUES(?,?,?)",person_data)

In [ ]:
car_data = [
    ('KA052250','Indica',1990),
('KA031181','Lancer',1957),
('KA095477','Toyota',1998),
('KA053408','Honda',2008),
('KA041702','Adui',2005)
]
db1.executemany("INSERT INTO car values(?,?,?)",car_data)

In [ ]:
accident_data = [
    (11,'2003-01-01','Mysore Road'),
(12,'2004-02-04','South End Circle'),
(13,'2003-01-03','Bull Temple Road'),
(14,'2008-02-08','Mysore Road'),
(15,'2005-03-05','Kanakapura Road')]
db1.executemany("INSERT INTO accident values(?,?,?)",accident_data)

In [ ]:
owns_data = [
    ('A01','KA052250'),
('A02','KA053408'),
('A03','KA031181'),
('A04','KA095477'),
('A05','KA041702')
]
db1.executemany("INSERT INTO owns values(?,?)",owns_data)

In [ ]:
participated_data = [
    ('A01','KA052250',11,10000),
('A02','KA053408',12,50000),
('A03','KA031181',13,25000),
('A04','KA095477',14,3000),
('A05','KA041702',15,5000)
]
db1.executemany("INSERT INTO participated values(?,?,?,?)",participated_data)

In [ ]:
for row in db1.execute("update participated set damage_amount = 25000 where reg_num = 'KA053408' and report_num = 12 "):
  print(row)

for row in db1.execute("select * from participated"):
  print(row)

('A01', 'KA052250', 11, 10000)
('A02', 'KA053408', 12, 25000)
('A03', 'KA031181', 13, 25000)
('A04', 'KA095477', 14, 3000)
('A05', 'KA041702', 15, 5000)

In [ ]:
for row in db1.execute("select count(*) from accident where strftime('%Y',accident_date) = '2008' "):
  print(row)

(1,)

In [ ]:
for row in db1.execute("select c.model as model, count(*) from car c join participated p ON p.reg_num = c.reg_num where c.model = 'Honda'"):
  print(row)

('Honda', 1)

## Banking Database

In [ ]:
db2 = sqlite3.connect("bank.db")
db2 = db2.cursor()

In [ ]:
db2.execute("CREATE TABLE Branch (branch_name VARCHAR(30), branch_city VARCHAR(30), assets REAL)")
db2.execute("CREATE TABLE BankAccount (accno INT PRIMARY KEY, branch_name VARCHAR(30), balance REAL, FOREIGN KEY (branch_name) REFERENCES Branch(branch_name))")
db2.execute("CREATE TABLE BankCustomer (customer_name VARCHAR(30), customer_street VARCHAR(30), customer_city VARCHAR(30))")
db2.execute("CREATE TABLE Depositer (customer_name VARCHAR(30), accno INT, FOREIGN KEY (customer_name) REFERENCES BankCustomer(customer_name), FOREIGN KEY (accno) REFERENCES BankAccount(accno))")
db2.execute("CREATE TABLE Loan (loan_number INT PRIMARY KEY, branch_name VARCHAR(30), amount REAL, FOREIGN KEY (branch_name) REFERENCES Branch(branch_name))")

In [ ]:
branch_data = [
    ('Branch1', 'City1', 1000000.00),
    ('Branch2', 'City2', 2000000.00),
    ('Branch3', 'City3', 3000000.00),
    ('Branch4', 'City4', 4000000.00),
    ('Branch5', 'City5', 5000000.00)
]

db2.executemany("Insert into branch values(?,?,?)",branch_data)

In [ ]:
bank_account_data = [
    (1001, 'Branch1', 5000.00),
    (1002, 'Branch2', 6000.00),
    (1003, 'Branch3', 7000.00),
    (1004, 'Branch4', 8000.00),
    (1005, 'Branch5', 9000.00)
]
db2.executemany("Insert into bankaccount values(?,?,?)",bank_account_data)

In [ ]:
bank_customer_data = [
    ('Customer1', 'Street1', 'City1'),
    ('Customer2', 'Street2', 'City2'),
    ('Customer3', 'Street3', 'City3'),
    ('Customer4', 'Street4', 'City4'),
    ('Customer5', 'Street5', 'City5')
]
db2.executemany("Insert into bankcustomer values(?,?,?)",bank_customer_data)

In [ ]:
depositer_data = [
    ('Customer1', 1001),
    ('Customer1', 1002),
    ('Customer2', 1003),
    ('Customer3', 1004),
    ('Customer4', 1005)
]

db2.executemany("Insert into Depositer values(?,?)",depositer_data)

In [ ]:
loan_data = [
    (2001, 'Branch1', 10000.00),
    (2002, 'Branch2', 20000.00),
    (2003, 'Branch3', 30000.00),
    (2004, 'Branch4', 40000.00),
    (2005, 'Branch5', 50000.00)
]

db2.executemany("Insert into Loan values(?,?,?)",loan_data)

In [ ]:
for row in db2.execute("select distinct bc.customer_name as customer_name from bankcustomer bc join depositer d on bc.customer_name = d.customer_name join bankaccount ba on ba.accno = d.accno group by bc.customer_name having count(Distinct ba.accno)>1"):
  print(row)

('Customer1',)

In [ ]:
for row in db2.execute("select customer_name from bankcustomer where customer_city = 'City3'"):
  print(row)

('Customer3',)

In [ ]:
db2.execute("delete from loan where branch_name in(select branch_name from branch where branch_city = 'City5')")
db2.execute("delete from bankcustomer where customer_city = 'City5' ")
db2.execute("delete from bankaccount where branch_name in (select branch_name from branch where branch_city = 'City5')")
db2.execute("delete from branch where branch_city = 'City5'")

##Supplier Database using Workbench

In [ ]:
db3 = sqlite3.connect('supplier')
db3 = db3.cursor()

In [ ]:
db3.execute("create table supplier(sid int primary key, sname varchar(30), address varchar(30))")
db3.execute("create table parts(pid int primary key, pname varchar(30), color varchar(30))")
db3.execute("create table catalog(sid int, pid int , cost real, foreign key(sid) references supplier(sid),foreign key(pid) references parts(pid), primary key(pid,sid))")

In [ ]:
sup_data = [
    (1, 'Acme Widget Suppliers', '123 Main St'),
(2, 'ABC Industries', '456 Elm St'),
(3, 'XYZ Manufacturing', '789 Oak St'),
(4, 'Smith Parts Co.', '101 Pine St'),
(5, 'Johnson Enterprises', '202 Cedar St')
]

db3.executemany("insert into supplier values(?,?,?)",sup_data)

In [ ]:
parts_data = [
    (1, 'A', 'Red'),
(2, 'B', 'Blue'),
(3, 'C', 'Green'),
(4, 'D', 'Yellow'),
(5, 'E', 'Orange'),
(6,'F','Red')
]
db3.executemany("insert into parts values(?,?,?)",parts_data)

In [ ]:
cat_data=[
(1,1,10),
(1,3,30),
(1,4,40),
(1,5,50),
(2,1,10),
(4,3,30),
(5,5,50),
(1,1,20),
(2,6,60)
]
db3.executemany("insert into catalog values(?,?,?)",cat_data)

IntegrityError: UNIQUE constraint failed: catalog.pid, catalog.sid

In [ ]:
db3.execute("delete from ca")

In [ ]:
for row in db3.execute("select * from catalog"):
  print(row)

(1, 1, 10.0)
(1, 3, 30.0)
(1, 4, 40.0)
(1, 5, 50.0)
(2, 1, 10.0)
(4, 3, 30.0)
(5, 5, 50.0)

In [ ]:
insert into supplier(sid,sname,address)
values
(1, 'Acme Widget Suppliers', '123 Main St'),
(2, 'ABC Industries', '456 Elm St'),
(3, 'XYZ Manufacturing', '789 Oak St'),
(4, 'Smith Parts Co.', '101 Pine St'),
(5, 'Johnson Enterprises', '202 Cedar St')


insert into parts(pid,pname,color)
values
(1, 'A', 'Red'),
(2, 'B', 'Blue'),
(3, 'C', 'Green'),
(4, 'D', 'Yellow'),
(5, 'E', 'Orange'),
(6,'F','Red')

insert into catalog(sid,pid,cost)
values
(1,1,10),
(1,3,30),
(1,4,40),
(1,5,50),
(2,1,10),
(4,3,30),
(5,5,50),
(1,1,20),
(2,6,60)


# Find the pnames of parts for which there is some supplier.
select distinct p.pname as part_name
from parts p
join catalog c on c.pid = p.pid

# Find the snames of suppliers who supply every part.
select sname as supllier_name
from supplier
where sid in(
	select sid
    from catalog
    where pid in(
		select pid
        from parts
        where color = 'Red'
    )
    group by sid
    having count(distinct pid) = (select count(*) from parts pid where color = 'Red')

)

# Find the pnames of parts supplied by Acme Widget Suppliers and by no one else.

select pname
from parts
where pid in(
	select pid
    from catalog
    where sid = (
		select sid
        from supplier
        where sname = 'Acme Widget Suppliers'
    )
)
and pid not in(
select pid from catalog
where sid <>(
	select sid
    from supplier
    where sname = 'Acme Widget Suppliers'
)
)

## student db, using workbench

In [ ]:
create database student
use student

CREATE TABLE STUDENT (snum INT PRIMARY KEY, sname VARCHAR(30), major VARCHAR(30), lvl VARCHAR(10), age INT);
CREATE TABLE FACULTY (fid INT PRIMARY KEY, fname VARCHAR(30), deptid INT);
CREATE TABLE CLASS (cname VARCHAR(50), meets_at TIME, room VARCHAR(20), fid INT, PRIMARY KEY (cname, meets_at), FOREIGN KEY (fid) REFERENCES FACULTY(fid));
CREATE TABLE ENROLLED (snum INT, cname VARCHAR(50), PRIMARY KEY (snum, cname), FOREIGN KEY (snum) REFERENCES STUDENT(snum), FOREIGN KEY (cname) REFERENCES CLASS(cname));


insert into student(snum,sname,major,lvl,age)
values
(1, 'John Doe', 'Computer Science', 'jr', 20),
(2, 'Jane Smith', 'Engineering', 'sr', 22),
(3, 'Alice Johnson', 'Biology', 'jr', 19),
(4, 'Bob Brown', 'Mathematics', 'sr', 21)

insert into faculty(fid,fname,deptid)
values
(101, 'Professor Smith', 1),
(102, 'Professor Johnson', 2),
(103, 'Professor Brown', 3),
(104, 'Professor White', 4)

insert into class(cname,meets_at,room,fid)
values
('Introduction to Programming', '08:00:00', 'A101', 101),
('Data Structures', '10:00:00', 'B203', 102),
('Chemistry 101', '09:30:00', 'C105', 103),
('Calculus II', '11:00:00', 'D301', 104)


insert into enrolled(snum,cname)
values
(1, 'Introduction to Programming'),
(2, 'Data Structures'),
(3, 'Chemistry 101'),
(4, 'Calculus II')

select s.sname,s.lvl, f.fname
from student s
join enrolled e on s.snum = e.snum
join class c on c.cname = e.cname
join faculty f on f.fid = c.fid
where s.lvl = 'jr'
and f.fname = 'Professor Smith'

select cname
from class
where room = 'B203'
or(select count(*)
from enrolled
where enrolled.cname = class.cname)>4

select sname
from student
where snum in(
	select snum
    from enrolled
    join class on enrolled.cname = class.cname
    group by snum,meets_at
    having count(*) >1
)

SELECT fname
FROM FACULTY
WHERE fid IN (
    SELECT fid
    FROM CLASS
    GROUP BY fid
    HAVING COUNT(DISTINCT room) = (
        SELECT COUNT(DISTINCT room)
        FROM CLASS
    )
)

SELECT fname
FROM FACULTY
WHERE fid IN (
    SELECT fid
    FROM CLASS
    JOIN ENROLLED ON CLASS.cname = ENROLLED.cname
    GROUP BY fid
    HAVING SUM(1) < 5
)